CSI API ETABS v1
cGridSys.GetTransformationMatrix Method
 Retrieves the grid system transformation matrix.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetTransformationMatrix(
	string Name,
	ref double[] Value
)
Function GetTransformationMatrix (
	Name As String,
	ByRef Value As Double()
) As Integer
Dim instance As cGridSys
Dim Name As String
Dim Value As Double()
Dim returnValue As Integer
returnValue = instance.GetTransformationMatrix(Name,
	Value)
int GetTransformationMatrix(
	String^ Name,
	array<double>^% Value
)
abstract GetTransformationMatrix :
        Name : string *
        Value : float[] byref -> int
Parameters
Name
Type: System.String
 The name of an existing grid system.
Value
Type: System.Double[]
 Value is an array of nine direction cosines that define the transformation matrix from the specified grid system to the global grid system.
Return Value
Type: Int32
 Returns zero if the grid system transformation matrix is successfully returned, otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'define new grid system
   ret = SapModel.GridSys.SetGridSys("GridSysA", 1000, 1000, 0, 0, 0, 0)
'get grid system transformation matrix
   ReDim Value(8)
   ret = SapModel.GridSys.GetTransformationMatrix("GridSysA", Value)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cGridSys Interface
ETABSv1 Namespace